#-------------------------------------------------------------------------------
# Name:        Листинг 2.7. Вычисление суммы чисел (арифмитическая прогрессия)
# Purpose:
#
# Author:      nicrad
#
# Created:     21.08.2022
# Copyright:   (c) nicrad 2022
# Licence:     <private>
#-------------------------------------------------------------------------------
#
# Исходный текст
start_text = "Python"
# Переменная для нумерачции букв
number_of_char = 1
# Оператор цикла
for char in start_text:
    # готовим вспомогательный текст
    iter_text = f"{number_of_char}-я буква:"
    # Выводим вспомогательный текст
    print(iter_text, char)
    # Изменеяем номер букв
    number_of_char += 1
# Команда после завершения оператора цикла
print("Работа программы завершена!")
